program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.3"}, {"coremlc-version", "1429.0.0"}, {"coremltools-component-torch", "1.13.0"}, {"coremltools-version", "6.1"}})]
{
    func main<ios16>(tensor<fp16, [1]> adjustment, tensor<fp16, [1, 3, 224, 224]> clip_input, tensor<fp16, [1, 512, 512, 3]> images) {
            tensor<int32, []> var_10 = const()[name = tensor<string, []>("op_10"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_14 = const()[name = tensor<string, []>("op_14"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_35 = const()[name = tensor<string, []>("op_35"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [2]> var_37 = const()[name = tensor<string, []>("op_37"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> patch_embeds_1_pad_type_0 = const()[name = tensor<string, []>("patch_embeds_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> patch_embeds_1_pad_0 = const()[name = tensor<string, []>("patch_embeds_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1024, 3, 14, 14]> vision_model_vision_model_embeddings_patch_embedding_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_embeddings_patch_embedding_weight_to_fp16"), val = tensor<fp16, [1024, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 1024, 16, 16]> patch_embeds_1_cast = conv(dilations = var_37, groups = var_14, pad = patch_embeds_1_pad_0, pad_type = patch_embeds_1_pad_type_0, strides = var_35, weight = vision_model_vision_model_embeddings_patch_embedding_weight_to_fp16, x = clip_input);
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 1024, 256])];
            tensor<fp16, [1, 1024, 256]> var_40_cast = reshape(shape = concat_0, x = patch_embeds_1_cast);
            tensor<int32, [3]> patch_embeds_perm_0 = const()[name = tensor<string, []>("patch_embeds_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> embeddings_1_interleave_0 = const()[name = tensor<string, []>("embeddings_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 1024]> class_embeds_to_fp16 = const()[name = tensor<string, []>("class_embeds_to_fp16"), val = tensor<fp16, [1, 1, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1204352)))];
            tensor<fp16, [1, 256, 1024]> transpose_120 = transpose(perm = patch_embeds_perm_0, x = var_40_cast);
            tensor<fp16, [1, 257, 1024]> embeddings_1_cast = concat(axis = var_14, interleave = embeddings_1_interleave_0, values = (class_embeds_to_fp16, transpose_120));
            tensor<fp16, [1, 257, 1024]> var_47_to_fp16 = const()[name = tensor<string, []>("op_47_to_fp16"), val = tensor<fp16, [1, 257, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1206464)))];
            tensor<fp16, [1, 257, 1024]> input_3_cast = add(x = embeddings_1_cast, y = var_47_to_fp16);
            tensor<int32, [1]> input_5_axes_0 = const()[name = tensor<string, []>("input_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_pre_layrnorm_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_pre_layrnorm_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1732864)))];
            tensor<fp16, [1024]> vision_model_vision_model_pre_layrnorm_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_pre_layrnorm_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1734976)))];
            tensor<fp16, []> var_18_to_fp16 = const()[name = tensor<string, []>("op_18_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 257, 1024]> input_5_cast = layer_norm(axes = input_5_axes_0, beta = vision_model_vision_model_pre_layrnorm_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_pre_layrnorm_weight_to_fp16, x = input_3_cast);
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1737088)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1739200)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = vision_model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_5_cast);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1741312)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3838528)))];
            tensor<fp16, [1, 257, 1024]> var_119_cast = linear(bias = vision_model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<fp16, []> var_120_to_fp16 = const()[name = tensor<string, []>("op_120_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 1024]> tensor_5_cast = mul(x = var_119_cast, y = var_120_to_fp16);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3840640)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5937856)))];
            tensor<fp16, [1, 257, 1024]> tensor_1_cast = linear(bias = vision_model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_125 = const()[name = tensor<string, []>("op_125"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_126_cast = reshape(shape = var_125, x = tensor_1_cast);
            tensor<int32, [4]> var_127_perm_0 = const()[name = tensor<string, []>("op_127_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5939968)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8037184)))];
            tensor<fp16, [1, 257, 1024]> tensor_3_cast = linear(bias = vision_model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_132 = const()[name = tensor<string, []>("op_132"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_133_cast = reshape(shape = var_132, x = tensor_3_cast);
            tensor<int32, [4]> var_134_perm_0 = const()[name = tensor<string, []>("op_134_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [4]>([1, 257, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_142_cast = reshape(shape = var_141, x = tensor_5_cast);
            tensor<int32, [4]> var_143_perm_0 = const()[name = tensor<string, []>("op_143_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_117 = transpose(perm = var_143_perm_0, x = var_142_cast);
            tensor<fp16, [16, 257, 64]> query_states_1_cast = reshape(shape = var_145, x = transpose_117);
            tensor<int32, [3]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_119 = transpose(perm = var_127_perm_0, x = var_126_cast);
            tensor<fp16, [16, 257, 64]> key_states_3_cast = reshape(shape = var_147, x = transpose_119);
            tensor<int32, [3]> var_149 = const()[name = tensor<string, []>("op_149"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_118 = transpose(perm = var_134_perm_0, x = var_133_cast);
            tensor<fp16, [16, 257, 64]> value_states_3_cast = reshape(shape = var_149, x = transpose_118);
            tensor<int32, [3]> var_151_perm_0 = const()[name = tensor<string, []>("op_151_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 257]> transpose_116 = transpose(perm = var_151_perm_0, x = key_states_3_cast);
            tensor<fp16, [16, 257, 257]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_116);
            tensor<fp16, [16, 257, 257]> input_7_cast = softmax(axis = var_10, x = attn_weights_1_cast);
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 257, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast);
            tensor<int32, [4]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [4]>([1, 16, 257, 64])];
            tensor<fp16, [1, 16, 257, 64]> attn_output_3_cast = reshape(shape = var_156, x = attn_output_1_cast);
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [3]>([1, 257, 1024])];
            tensor<fp16, [1, 257, 16, 64]> transpose_115 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast);
            tensor<fp16, [1, 257, 1024]> input_9_cast = reshape(shape = var_159, x = transpose_115);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8039296)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10136512)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_3_cast = linear(bias = vision_model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast);
            tensor<fp16, [1, 257, 1024]> input_11_cast = add(x = input_5_cast, y = hidden_states_3_cast);
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10138624)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10140736)))];
            tensor<fp16, [1, 257, 1024]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = vision_model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast);
            tensor<fp16, [4096, 1024]> vision_model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10142848)))];
            tensor<fp16, [4096]> vision_model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18531520)))];
            tensor<fp16, [1, 257, 4096]> input_15_cast = linear(bias = vision_model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_13_cast);
            tensor<fp16, []> var_174_to_fp16 = const()[name = tensor<string, []>("op_174_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 257, 4096]> var_175_cast = mul(x = input_15_cast, y = var_174_to_fp16);
            tensor<fp16, [1, 257, 4096]> var_176_cast = sigmoid(x = var_175_cast);
            tensor<fp16, [1, 257, 4096]> input_17_cast = mul(x = input_15_cast, y = var_176_cast);
            tensor<fp16, [1024, 4096]> vision_model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18539776)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26928448)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_5_cast = linear(bias = vision_model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_17_cast);
            tensor<fp16, [1, 257, 1024]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast);
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26930560)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26932672)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = vision_model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26934784)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29032000)))];
            tensor<fp16, [1, 257, 1024]> var_200_cast = linear(bias = vision_model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<fp16, []> var_201_to_fp16 = const()[name = tensor<string, []>("op_201_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 1024]> tensor_11_cast = mul(x = var_200_cast, y = var_201_to_fp16);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29034112)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31131328)))];
            tensor<fp16, [1, 257, 1024]> tensor_7_cast = linear(bias = vision_model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_206 = const()[name = tensor<string, []>("op_206"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_207_cast = reshape(shape = var_206, x = tensor_7_cast);
            tensor<int32, [4]> var_208_perm_0 = const()[name = tensor<string, []>("op_208_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31133440)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33230656)))];
            tensor<fp16, [1, 257, 1024]> tensor_9_cast = linear(bias = vision_model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_214_cast = reshape(shape = var_213, x = tensor_9_cast);
            tensor<int32, [4]> var_215_perm_0 = const()[name = tensor<string, []>("op_215_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [4]>([1, 257, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_223_cast = reshape(shape = var_222, x = tensor_11_cast);
            tensor<int32, [4]> var_224_perm_0 = const()[name = tensor<string, []>("op_224_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_112 = transpose(perm = var_224_perm_0, x = var_223_cast);
            tensor<fp16, [16, 257, 64]> query_states_3_cast = reshape(shape = var_226, x = transpose_112);
            tensor<int32, [3]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_114 = transpose(perm = var_208_perm_0, x = var_207_cast);
            tensor<fp16, [16, 257, 64]> key_states_7_cast = reshape(shape = var_228, x = transpose_114);
            tensor<int32, [3]> var_230 = const()[name = tensor<string, []>("op_230"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_113 = transpose(perm = var_215_perm_0, x = var_214_cast);
            tensor<fp16, [16, 257, 64]> value_states_7_cast = reshape(shape = var_230, x = transpose_113);
            tensor<int32, [3]> var_232_perm_0 = const()[name = tensor<string, []>("op_232_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_5_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_5_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 257]> transpose_111 = transpose(perm = var_232_perm_0, x = key_states_7_cast);
            tensor<fp16, [16, 257, 257]> attn_weights_5_cast = matmul(transpose_x = attn_weights_5_transpose_x_0, transpose_y = attn_weights_5_transpose_y_0, x = query_states_3_cast, y = transpose_111);
            tensor<fp16, [16, 257, 257]> input_21_cast = softmax(axis = var_10, x = attn_weights_5_cast);
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 257, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_21_cast, y = value_states_7_cast);
            tensor<int32, [4]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [4]>([1, 16, 257, 64])];
            tensor<fp16, [1, 16, 257, 64]> attn_output_9_cast = reshape(shape = var_237, x = attn_output_7_cast);
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_240 = const()[name = tensor<string, []>("op_240"), val = tensor<int32, [3]>([1, 257, 1024])];
            tensor<fp16, [1, 257, 16, 64]> transpose_110 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast);
            tensor<fp16, [1, 257, 1024]> input_23_cast = reshape(shape = var_240, x = transpose_110);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33232768)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35329984)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_9_cast = linear(bias = vision_model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_23_cast);
            tensor<fp16, [1, 257, 1024]> input_25_cast = add(x = input_19_cast, y = hidden_states_9_cast);
            tensor<int32, [1]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35332096)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35334208)))];
            tensor<fp16, [1, 257, 1024]> input_27_cast = layer_norm(axes = input_27_axes_0, beta = vision_model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_25_cast);
            tensor<fp16, [4096, 1024]> vision_model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35336320)))];
            tensor<fp16, [4096]> vision_model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43724992)))];
            tensor<fp16, [1, 257, 4096]> input_29_cast = linear(bias = vision_model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_27_cast);
            tensor<fp16, []> var_255_to_fp16 = const()[name = tensor<string, []>("op_255_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 257, 4096]> var_256_cast = mul(x = input_29_cast, y = var_255_to_fp16);
            tensor<fp16, [1, 257, 4096]> var_257_cast = sigmoid(x = var_256_cast);
            tensor<fp16, [1, 257, 4096]> input_31_cast = mul(x = input_29_cast, y = var_257_cast);
            tensor<fp16, [1024, 4096]> vision_model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43733248)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52121920)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_11_cast = linear(bias = vision_model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_31_cast);
            tensor<fp16, [1, 257, 1024]> input_33_cast = add(x = input_25_cast, y = hidden_states_11_cast);
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52124032)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52126144)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = vision_model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_33_cast);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52128256)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54225472)))];
            tensor<fp16, [1, 257, 1024]> var_281_cast = linear(bias = vision_model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<fp16, []> var_282_to_fp16 = const()[name = tensor<string, []>("op_282_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 1024]> tensor_17_cast = mul(x = var_281_cast, y = var_282_to_fp16);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54227584)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56324800)))];
            tensor<fp16, [1, 257, 1024]> tensor_13_cast = linear(bias = vision_model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_288_cast = reshape(shape = var_287, x = tensor_13_cast);
            tensor<int32, [4]> var_289_perm_0 = const()[name = tensor<string, []>("op_289_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56326912)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58424128)))];
            tensor<fp16, [1, 257, 1024]> tensor_15_cast = linear(bias = vision_model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_295_cast = reshape(shape = var_294, x = tensor_15_cast);
            tensor<int32, [4]> var_296_perm_0 = const()[name = tensor<string, []>("op_296_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_303 = const()[name = tensor<string, []>("op_303"), val = tensor<int32, [4]>([1, 257, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_304_cast = reshape(shape = var_303, x = tensor_17_cast);
            tensor<int32, [4]> var_305_perm_0 = const()[name = tensor<string, []>("op_305_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_307 = const()[name = tensor<string, []>("op_307"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_107 = transpose(perm = var_305_perm_0, x = var_304_cast);
            tensor<fp16, [16, 257, 64]> query_states_5_cast = reshape(shape = var_307, x = transpose_107);
            tensor<int32, [3]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_109 = transpose(perm = var_289_perm_0, x = var_288_cast);
            tensor<fp16, [16, 257, 64]> key_states_11_cast = reshape(shape = var_309, x = transpose_109);
            tensor<int32, [3]> var_311 = const()[name = tensor<string, []>("op_311"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 257, 64]> transpose_108 = transpose(perm = var_296_perm_0, x = var_295_cast);
            tensor<fp16, [16, 257, 64]> value_states_11_cast = reshape(shape = var_311, x = transpose_108);
            tensor<int32, [3]> var_313_perm_0 = const()[name = tensor<string, []>("op_313_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_9_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_9_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 257]> transpose_106 = transpose(perm = var_313_perm_0, x = key_states_11_cast);
            tensor<fp16, [16, 257, 257]> attn_weights_9_cast = matmul(transpose_x = attn_weights_9_transpose_x_0, transpose_y = attn_weights_9_transpose_y_0, x = query_states_5_cast, y = transpose_106);
            tensor<fp16, [16, 257, 257]> input_35_cast = softmax(axis = var_10, x = attn_weights_9_cast);
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 257, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_35_cast, y = value_states_11_cast);
            tensor<int32, [4]> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, [4]>([1, 16, 257, 64])];
            tensor<fp16, [1, 16, 257, 64]> attn_output_15_cast = reshape(shape = var_318, x = attn_output_13_cast);
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_321 = const()[name = tensor<string, []>("op_321"), val = tensor<int32, [3]>([1, 257, 1024])];
            tensor<fp16, [1, 257, 16, 64]> transpose_105 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast);
            tensor<fp16, [1, 257, 1024]> input_37_cast = reshape(shape = var_321, x = transpose_105);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58426240)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60523456)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_15_cast = linear(bias = vision_model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = input_37_cast);
            tensor<fp16, [1, 257, 1024]> input_39_cast = add(x = input_33_cast, y = hidden_states_15_cast);
            tensor<int32, [1]> input_41_axes_0 = const()[name = tensor<string, []>("input_41_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60525568)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60527680)))];
            tensor<fp16, [1, 257, 1024]> input_41_cast = layer_norm(axes = input_41_axes_0, beta = vision_model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_39_cast);
            tensor<fp16, [4096, 1024]> vision_model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60529792)))];
            tensor<fp16, [4096]> vision_model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68918464)))];
            tensor<fp16, [1, 257, 4096]> input_43_cast = linear(bias = vision_model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_41_cast);
            tensor<fp16, []> var_336_to_fp16 = const()[name = tensor<string, []>("op_336_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 257, 4096]> var_337_cast = mul(x = input_43_cast, y = var_336_to_fp16);
            tensor<fp16, [1, 257, 4096]> var_338_cast = sigmoid(x = var_337_cast);
            tensor<fp16, [1, 257, 4096]> input_45_cast = mul(x = input_43_cast, y = var_338_cast);
            tensor<fp16, [1024, 4096]> vision_model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68926720)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77315392)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_17_cast = linear(bias = vision_model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_45_cast);
            tensor<fp16, [1, 257, 1024]> input_47_cast = add(x = input_39_cast, y = hidden_states_17_cast);
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77317504)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77319616)))];
            tensor<fp16, [1, 257, 1024]> hidden_states_19_cast = layer_norm(axes = hidden_states_19_axes_0, beta = vision_model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_18_to_fp16, gamma = vision_model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_47_cast);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77321728)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79418944)))];
            tensor<fp16, [1, 257, 1024]> var_362_cast = linear(bias = vision_model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<fp16, []> var_363_to_fp16 = const()[name = tensor<string, []>("op_363_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 257, 1024]> tensor_23_cast = mul(x = var_362_cast, y = var_363_to_fp16);
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79421056)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81518272)))];
            tensor<fp16, [1, 257, 1024]> tensor_19_cast = linear(bias = vision_model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_368 = const()[name = tensor<string, []>("op_368"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_369_cast = reshape(shape = var_368, x = tensor_19_cast);
            tensor<int32, [4]> var_370_perm_0 = const()[name = tensor<string, []>("op_370_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> vision_model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81520384)))];
            tensor<fp16, [1024]> vision_model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83617600)))];
            tensor<fp16, [1, 257, 1024]> tensor_21_cast = linear(bias = vision_model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16, weight = vision_model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_375 = const()[name = tensor<string, []>("op_375"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_376_cast = reshape(shape = var_375, x = tensor_21_cast);
            tensor<int32, [4]> var_377_perm_0 = const()[name = tensor<string, []>("op_377_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_384 = const()[name = tensor<string, []>("op_384"), val = tensor<int32, [4]>([1, 257, 16, 64])];
            tensor<fp16, [1, 257, 16, 64]> var_385_cast = reshape(shape = var_384, x = tensor_23_cast);
            tensor<int32, [4]> var_386_perm_0 = const()[name = tensor<string, []>("op_386_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [3]>([16, -1, 64])];
