program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.3"}, {"coremlc-version", "1429.0.0"}, {"coremltools-component-torch", "1.13.0"}, {"coremltools-version", "6.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 77]> input_ids) {
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<bool, []>(false)];
            tensor<string, []> cast_1_dtype_0 = const()[name = tensor<string, []>("cast_1_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [49408, 768]> text_encoder_text_model_embeddings_token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_embeddings_token_embedding_weight_to_fp16"), val = tensor<fp16, [49408, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, [1, 77]> cast_527 = cast(dtype = cast_1_dtype_0, x = input_ids);
            tensor<fp16, [1, 77, 768]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = cast_527, x = text_encoder_text_model_embeddings_token_embedding_weight_to_fp16);
            tensor<fp16, [1, 77, 768]> position_embeddings_to_fp16 = const()[name = tensor<string, []>("position_embeddings_to_fp16"), val = tensor<fp16, [1, 77, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75890816)))];
            tensor<fp16, [1, 77, 768]> input_3_cast = add(x = inputs_embeds_cast, y = position_embeddings_to_fp16);
            tensor<int32, []> band_part_0_lower_0 = const()[name = tensor<string, []>("band_part_0_lower_0"), val = tensor<int32, []>(-1)];
            tensor<int32, []> band_part_0_upper_0 = const()[name = tensor<string, []>("band_part_0_upper_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 77, 77]> mask_1_to_fp16 = const()[name = tensor<string, []>("mask_1_to_fp16"), val = tensor<fp16, [1, 77, 77]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76009152)))];
            tensor<fp16, [1, 77, 77]> band_part_0_cast = band_part(lower = band_part_0_lower_0, upper = band_part_0_upper_0, x = mask_1_to_fp16);
            tensor<fp16, [1, 77, 77]> mask_cast = sub(x = mask_1_to_fp16, y = band_part_0_cast);
            tensor<int32, [1]> var_43_axes_0 = const()[name = tensor<string, []>("op_43_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 77, 77]> var_43_cast = expand_dims(axes = var_43_axes_0, x = mask_cast);
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76021120)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76022720)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 77, 768]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_3_cast);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76024320)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77204032)))];
            tensor<fp16, [1, 77, 768]> var_87_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<fp16, []> var_88_to_fp16 = const()[name = tensor<string, []>("op_88_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_5_cast = mul(x = var_87_cast, y = var_88_to_fp16);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77205632)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78385344)))];
            tensor<fp16, [1, 77, 768]> tensor_1_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_93 = const()[name = tensor<string, []>("op_93"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_94_cast = reshape(shape = var_93, x = tensor_1_cast);
            tensor<int32, [4]> var_95_perm_0 = const()[name = tensor<string, []>("op_95_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78386944)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79566656)))];
            tensor<fp16, [1, 77, 768]> tensor_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_101_cast = reshape(shape = var_100, x = tensor_3_cast);
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_109 = const()[name = tensor<string, []>("op_109"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_110_cast = reshape(shape = var_109, x = tensor_5_cast);
            tensor<int32, [4]> var_111_perm_0 = const()[name = tensor<string, []>("op_111_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_113 = const()[name = tensor<string, []>("op_113"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_58 = transpose(perm = var_111_perm_0, x = var_110_cast);
            tensor<fp16, [12, 77, 64]> query_states_1_cast = reshape(shape = var_113, x = transpose_58);
            tensor<int32, [3]> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_60 = transpose(perm = var_95_perm_0, x = var_94_cast);
            tensor<fp16, [12, 77, 64]> key_states_3_cast = reshape(shape = var_115, x = transpose_60);
            tensor<int32, [3]> var_117 = const()[name = tensor<string, []>("op_117"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_59 = transpose(perm = var_102_perm_0, x = var_101_cast);
            tensor<fp16, [12, 77, 64]> value_states_3_cast = reshape(shape = var_117, x = transpose_59);
            tensor<int32, [3]> var_120_perm_0 = const()[name = tensor<string, []>("op_120_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_57 = transpose(perm = var_120_perm_0, x = key_states_3_cast);
            tensor<fp16, [12, 77, 77]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_57);
            tensor<int32, [4]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_123_cast = reshape(shape = var_122, x = attn_weights_1_cast);
            tensor<fp16, [1, 12, 77, 77]> attn_weights_3_cast = add(x = var_123_cast, y = var_43_cast);
            tensor<int32, [3]> var_128 = const()[name = tensor<string, []>("op_128"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_5_cast = reshape(shape = var_128, x = attn_weights_3_cast);
            tensor<fp16, [12, 77, 77]> input_7_cast = softmax(axis = var_5, x = input_5_cast);
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast);
            tensor<int32, [4]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_3_cast = reshape(shape = var_133, x = attn_output_1_cast);
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_56 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast);
            tensor<fp16, [1, 77, 768]> input_9_cast = reshape(shape = var_136, x = transpose_56);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79568256)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80747968)))];
            tensor<fp16, [1, 77, 768]> hidden_states_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast);
            tensor<fp16, [1, 77, 768]> input_11_cast = add(x = input_3_cast, y = hidden_states_3_cast);
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80749568)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80751168)))];
            tensor<fp16, [1, 77, 768]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast);
            tensor<fp16, [3072, 768]> text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80752768)))];
            tensor<fp16, [3072]> text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85471424)))];
            tensor<fp16, [1, 77, 3072]> input_15_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_13_cast);
            tensor<fp16, []> var_151_to_fp16 = const()[name = tensor<string, []>("op_151_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 77, 3072]> var_152_cast = mul(x = input_15_cast, y = var_151_to_fp16);
            tensor<fp16, [1, 77, 3072]> var_153_cast = sigmoid(x = var_152_cast);
            tensor<fp16, [1, 77, 3072]> input_17_cast = mul(x = input_15_cast, y = var_153_cast);
            tensor<fp16, [768, 3072]> text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85477632)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90196288)))];
            tensor<fp16, [1, 77, 768]> hidden_states_5_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_17_cast);
            tensor<fp16, [1, 77, 768]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast);
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90197888)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90199488)))];
            tensor<fp16, [1, 77, 768]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90201088)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91380800)))];
            tensor<fp16, [1, 77, 768]> var_177_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<fp16, []> var_178_to_fp16 = const()[name = tensor<string, []>("op_178_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_11_cast = mul(x = var_177_cast, y = var_178_to_fp16);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91382400)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(92562112)))];
            tensor<fp16, [1, 77, 768]> tensor_7_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_184_cast = reshape(shape = var_183, x = tensor_7_cast);
            tensor<int32, [4]> var_185_perm_0 = const()[name = tensor<string, []>("op_185_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(92563712)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93743424)))];
            tensor<fp16, [1, 77, 768]> tensor_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_191_cast = reshape(shape = var_190, x = tensor_9_cast);
            tensor<int32, [4]> var_192_perm_0 = const()[name = tensor<string, []>("op_192_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_199 = const()[name = tensor<string, []>("op_199"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_200_cast = reshape(shape = var_199, x = tensor_11_cast);
            tensor<int32, [4]> var_201_perm_0 = const()[name = tensor<string, []>("op_201_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_53 = transpose(perm = var_201_perm_0, x = var_200_cast);
            tensor<fp16, [12, 77, 64]> query_states_3_cast = reshape(shape = var_203, x = transpose_53);
            tensor<int32, [3]> var_205 = const()[name = tensor<string, []>("op_205"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_55 = transpose(perm = var_185_perm_0, x = var_184_cast);
            tensor<fp16, [12, 77, 64]> key_states_7_cast = reshape(shape = var_205, x = transpose_55);
            tensor<int32, [3]> var_207 = const()[name = tensor<string, []>("op_207"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_54 = transpose(perm = var_192_perm_0, x = var_191_cast);
            tensor<fp16, [12, 77, 64]> value_states_7_cast = reshape(shape = var_207, x = transpose_54);
            tensor<int32, [3]> var_210_perm_0 = const()[name = tensor<string, []>("op_210_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_7_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_52 = transpose(perm = var_210_perm_0, x = key_states_7_cast);
            tensor<fp16, [12, 77, 77]> attn_weights_7_cast = matmul(transpose_x = attn_weights_7_transpose_x_0, transpose_y = attn_weights_7_transpose_y_0, x = query_states_3_cast, y = transpose_52);
            tensor<int32, [4]> var_212 = const()[name = tensor<string, []>("op_212"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_213_cast = reshape(shape = var_212, x = attn_weights_7_cast);
            tensor<fp16, [1, 12, 77, 77]> attn_weights_9_cast = add(x = var_213_cast, y = var_43_cast);
            tensor<int32, [3]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_21_cast = reshape(shape = var_218, x = attn_weights_9_cast);
            tensor<fp16, [12, 77, 77]> input_23_cast = softmax(axis = var_5, x = input_21_cast);
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_23_cast, y = value_states_7_cast);
            tensor<int32, [4]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_9_cast = reshape(shape = var_223, x = attn_output_7_cast);
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_51 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast);
            tensor<fp16, [1, 77, 768]> input_25_cast = reshape(shape = var_226, x = transpose_51);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93745024)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94924736)))];
            tensor<fp16, [1, 77, 768]> hidden_states_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_25_cast);
            tensor<fp16, [1, 77, 768]> input_27_cast = add(x = input_19_cast, y = hidden_states_9_cast);
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94926336)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94927936)))];
            tensor<fp16, [1, 77, 768]> input_29_cast = layer_norm(axes = input_29_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_27_cast);
            tensor<fp16, [3072, 768]> text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94929536)))];
            tensor<fp16, [3072]> text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(99648192)))];
            tensor<fp16, [1, 77, 3072]> input_31_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_29_cast);
            tensor<fp16, []> var_241_to_fp16 = const()[name = tensor<string, []>("op_241_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 77, 3072]> var_242_cast = mul(x = input_31_cast, y = var_241_to_fp16);
            tensor<fp16, [1, 77, 3072]> var_243_cast = sigmoid(x = var_242_cast);
            tensor<fp16, [1, 77, 3072]> input_33_cast = mul(x = input_31_cast, y = var_243_cast);
            tensor<fp16, [768, 3072]> text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(99654400)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104373056)))];
            tensor<fp16, [1, 77, 768]> hidden_states_11_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_33_cast);
            tensor<fp16, [1, 77, 768]> input_35_cast = add(x = input_27_cast, y = hidden_states_11_cast);
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104374656)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104376256)))];
            tensor<fp16, [1, 77, 768]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_35_cast);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104377856)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(105557568)))];
            tensor<fp16, [1, 77, 768]> var_267_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<fp16, []> var_268_to_fp16 = const()[name = tensor<string, []>("op_268_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_17_cast = mul(x = var_267_cast, y = var_268_to_fp16);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(105559168)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106738880)))];
            tensor<fp16, [1, 77, 768]> tensor_13_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_273 = const()[name = tensor<string, []>("op_273"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_274_cast = reshape(shape = var_273, x = tensor_13_cast);
            tensor<int32, [4]> var_275_perm_0 = const()[name = tensor<string, []>("op_275_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106740480)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107920192)))];
            tensor<fp16, [1, 77, 768]> tensor_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_281_cast = reshape(shape = var_280, x = tensor_15_cast);
            tensor<int32, [4]> var_282_perm_0 = const()[name = tensor<string, []>("op_282_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_290_cast = reshape(shape = var_289, x = tensor_17_cast);
            tensor<int32, [4]> var_291_perm_0 = const()[name = tensor<string, []>("op_291_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_293 = const()[name = tensor<string, []>("op_293"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_48 = transpose(perm = var_291_perm_0, x = var_290_cast);
            tensor<fp16, [12, 77, 64]> query_states_5_cast = reshape(shape = var_293, x = transpose_48);
            tensor<int32, [3]> var_295 = const()[name = tensor<string, []>("op_295"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_50 = transpose(perm = var_275_perm_0, x = var_274_cast);
            tensor<fp16, [12, 77, 64]> key_states_11_cast = reshape(shape = var_295, x = transpose_50);
            tensor<int32, [3]> var_297 = const()[name = tensor<string, []>("op_297"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_49 = transpose(perm = var_282_perm_0, x = var_281_cast);
            tensor<fp16, [12, 77, 64]> value_states_11_cast = reshape(shape = var_297, x = transpose_49);
            tensor<int32, [3]> var_300_perm_0 = const()[name = tensor<string, []>("op_300_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_13_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_47 = transpose(perm = var_300_perm_0, x = key_states_11_cast);
            tensor<fp16, [12, 77, 77]> attn_weights_13_cast = matmul(transpose_x = attn_weights_13_transpose_x_0, transpose_y = attn_weights_13_transpose_y_0, x = query_states_5_cast, y = transpose_47);
            tensor<int32, [4]> var_302 = const()[name = tensor<string, []>("op_302"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_303_cast = reshape(shape = var_302, x = attn_weights_13_cast);
            tensor<fp16, [1, 12, 77, 77]> attn_weights_15_cast = add(x = var_303_cast, y = var_43_cast);
            tensor<int32, [3]> var_308 = const()[name = tensor<string, []>("op_308"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_37_cast = reshape(shape = var_308, x = attn_weights_15_cast);
            tensor<fp16, [12, 77, 77]> input_39_cast = softmax(axis = var_5, x = input_37_cast);
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast, y = value_states_11_cast);
            tensor<int32, [4]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_15_cast = reshape(shape = var_313, x = attn_output_13_cast);
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_316 = const()[name = tensor<string, []>("op_316"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_46 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast);
            tensor<fp16, [1, 77, 768]> input_41_cast = reshape(shape = var_316, x = transpose_46);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107921792)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109101504)))];
            tensor<fp16, [1, 77, 768]> hidden_states_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = input_41_cast);
            tensor<fp16, [1, 77, 768]> input_43_cast = add(x = input_35_cast, y = hidden_states_15_cast);
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109103104)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109104704)))];
            tensor<fp16, [1, 77, 768]> input_45_cast = layer_norm(axes = input_45_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_43_cast);
            tensor<fp16, [3072, 768]> text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109106304)))];
            tensor<fp16, [3072]> text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113824960)))];
            tensor<fp16, [1, 77, 3072]> input_47_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_45_cast);
            tensor<fp16, []> var_331_to_fp16 = const()[name = tensor<string, []>("op_331_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 77, 3072]> var_332_cast = mul(x = input_47_cast, y = var_331_to_fp16);
            tensor<fp16, [1, 77, 3072]> var_333_cast = sigmoid(x = var_332_cast);
            tensor<fp16, [1, 77, 3072]> input_49_cast = mul(x = input_47_cast, y = var_333_cast);
            tensor<fp16, [768, 3072]> text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113831168)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118549824)))];
            tensor<fp16, [1, 77, 768]> hidden_states_17_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_49_cast);
            tensor<fp16, [1, 77, 768]> input_51_cast = add(x = input_43_cast, y = hidden_states_17_cast);
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118551424)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118553024)))];
            tensor<fp16, [1, 77, 768]> hidden_states_19_cast = layer_norm(axes = hidden_states_19_axes_0, beta = text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_51_cast);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118554624)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119734336)))];
            tensor<fp16, [1, 77, 768]> var_357_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<fp16, []> var_358_to_fp16 = const()[name = tensor<string, []>("op_358_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_23_cast = mul(x = var_357_cast, y = var_358_to_fp16);
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119735936)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120915648)))];
            tensor<fp16, [1, 77, 768]> tensor_19_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_363 = const()[name = tensor<string, []>("op_363"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_364_cast = reshape(shape = var_363, x = tensor_19_cast);
            tensor<int32, [4]> var_365_perm_0 = const()[name = tensor<string, []>("op_365_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120917248)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122096960)))];
            tensor<fp16, [1, 77, 768]> tensor_21_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_370 = const()[name = tensor<string, []>("op_370"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_371_cast = reshape(shape = var_370, x = tensor_21_cast);
            tensor<int32, [4]> var_372_perm_0 = const()[name = tensor<string, []>("op_372_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_379 = const()[name = tensor<string, []>("op_379"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_380_cast = reshape(shape = var_379, x = tensor_23_cast);
            tensor<int32, [4]> var_381_perm_0 = const()[name = tensor<string, []>("op_381_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_383 = const()[name = tensor<string, []>("op_383"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_43 = transpose(perm = var_381_perm_0, x = var_380_cast);
            tensor<fp16, [12, 77, 64]> query_states_7_cast = reshape(shape = var_383, x = transpose_43);
